In [3]:
import pandas as pd
l=[['Akash',100,'Sasaram'],        # Create from list
   ['Kumar',98,'Patna'],
   ['Gupta',99,'Bhopal']]
d_l=pd.DataFrame(l,columns=('name','marks','place'),index=('R1','R2','R3'))
d_l

     name  marks    place
R1  Akash    100  Sasaram
R2  Kumar     98    Patna
R3  Gupta     99   Bhopal

In [4]:
d=pd.DataFrame({'Name':['Akash','Kumar','Gupta'],
               'Marks':[100,98,99]
               })
d

    Name  Marks
0  Akash    100
1  Kumar     98
2  Gupta     99

In [5]:
# creating Dataframe from dictionary
d={'name':['Akash','Kumar','Gupta'],'Marks':[10,20,30]}
d=pd.DataFrame(d)
d

    name  Marks
0  Akash     10
1  Kumar     20
2  Gupta     30

In [6]:
# create csv file from dataframe
d.to_csv('DataFrame_Akash.csv',index=False)

In [7]:
d=pd.read_csv('DataFrame_Akash.csv')
d

    name  Marks
0  Akash     10
1  Kumar     20
2  Gupta     30

In [8]:
d['name']                  # extract columns as Series

0    Akash
1    Kumar
2    Gupta
Name: name, dtype: object

In [9]:
d['Marks']

0    10
1    20
2    30
Name: Marks, dtype: int64

In [10]:
e_a=d['name']
e_a

0    Akash
1    Kumar
2    Gupta
Name: name, dtype: object

In [12]:
# if you use duble square Bracket then it will become dic

In [13]:
#e_a[['name']]
w=[[e_a]] # it will become list
type(w)

list

In [14]:
d[['name']]

    name
0  Akash
1  Kumar
2  Gupta

In [15]:
# extracting Series from DataFrame -
s=pd.Series(d['name'])
s1=d['name']
s,s1

(0    Akash
 1    Kumar
 2    Gupta
 Name: name, dtype: object,
 0    Akash
 1    Kumar
 2    Gupta
 Name: name, dtype: object)

In [16]:
# most Importent  in matplotlinb and seaborn
# value, index & columns
v_s=s.values   # casting in array
i_s=s.index
c_d=d.columns
v_s,i_s,c_d

(array(['Akash', 'Kumar', 'Gupta'], dtype=object),
 RangeIndex(start=0, stop=3, step=1),
 Index(['name', 'Marks'], dtype='object'))

In [18]:
pd.DataFrame(v_s)

       0
0  Akash
1  Kumar
2  Gupta

In [19]:
# convert value and index into list
s_v_l=s.values.tolist()  # array then list - v.values.tolist()
s_i_l=s.index.tolist()
s_v_l,s_i_l

(['Akash', 'Kumar', 'Gupta'], [0, 1, 2])

In [20]:
import numpy as np
import random
arr=np.random.rand(10).reshape(2,5)
pd.DataFrame(arr)

          0         1         2         3         4
0  0.546016  0.479418  0.417539  0.196347  0.039418
1  0.969686  0.123504  0.496637  0.473696  0.494804

In [21]:
# extracting elements from series  through indexing 
s[2],s[0],s[1]

('Gupta', 'Akash', 'Kumar')

In [22]:
# extracting elements from dictionary through slicing
s[:2],s[-5:-1]

(0    Akash
 1    Kumar
 Name: name, dtype: object,
 0    Akash
 1    Kumar
 Name: name, dtype: object)

In [23]:
s=pd.Series([1,2,3,4,4,6,5])
s.mean(),s.mode(),s.median(),s.count(),s.cumsum(),s.cumprod() # cumulative sum & product

(3.5714285714285716,
 0    4
 dtype: int64,
 4.0,
 7,
 0     1
 1     3
 2     6
 3    10
 4    14
 5    20
 6    25
 dtype: int64,
 0       1
 1       2
 2       6
 3      24
 4      96
 5     576
 6    2880
 dtype: int64)

In [24]:
# DataFrame - most importent creating dataframe from Series
l=[1,2,3,4,5]
l2=['a','b','c','d','e']
s=pd.Series(l)
s1=pd.Series(l2)
s,s1

(0    1
 1    2
 2    3
 3    4
 4    5
 dtype: int64,
 0    a
 1    b
 2    c
 3    d
 4    e
 dtype: object)

In [25]:
d_s=pd.DataFrame({'int':s,'str':s1})
d_s

   int str
0    1   a
1    2   b
2    3   c
3    4   d
4    5   e

In [26]:
d_s.shape

(5, 2)

In [28]:
# adding sering in dataframe
l='A','B','C','D','E'
s_a_d=pd.Series(l)
s_a_d,s_a_d.shape

(0    A
 1    B
 2    C
 3    D
 4    E
 dtype: object,
 (5,))

In [29]:
d_s_a=d_s['U_str']=s_a_d   # v[key(given_name)]=value(series as value)
d_s_a # here single value assign to multiple variable

0    A
1    B
2    C
3    D
4    E
dtype: object

In [30]:
l=[1.1,1.2,1.3,1.4,1.5]
f_s=pd.Series(l)
d_s['float']=f_s    # variable['key'(a key give name)]=value(pass Series)

In [31]:
d_s

   int str U_str  float
0    1   a     A    1.1
1    2   b     B    1.2
2    3   c     C    1.3
3    4   d     D    1.4
4    5   e     E    1.5

In [32]:
d_s.set_index('float')

       int str U_str
float
1.1      1   a     A
1.2      2   b     B
1.3      3   c     C
1.4      4   d     D
1.5      5   e     E

In [33]:
d_l.sort_index(ascending=False)

     name  marks    place
R3  Gupta     99   Bhopal
R2  Kumar     98    Patna
R1  Akash    100  Sasaram

In [34]:
d_l.sort_index(axis=1) # OR to print column names in reverse alphabetical order 
# v.sort_index(axis=1,ascending=False)

    marks   name    place
R1    100  Akash  Sasaram
R2     98  Kumar    Patna
R3     99  Gupta   Bhopal

In [35]:
d_l.sort_index(axis=0,ascending=False) # alphabetical order

     name  marks    place
R3  Gupta     99   Bhopal
R2  Kumar     98    Patna
R1  Akash    100  Sasaram

In [36]:
d_l.sort_index(axis=0)

     name  marks    place
R1  Akash    100  Sasaram
R2  Kumar     98    Patna
R3  Gupta     99   Bhopal

In [37]:
#v.sort_value(by='col', ascending=fasle)  # colums wise asceding true or false

In [38]:
d=pd.Series([33,32,31],index=('r1','r2','r3'))
d_l['ages']=d
d_l

     name  marks    place  ages
R1  Akash    100  Sasaram   NaN
R2  Kumar     98    Patna   NaN
R3  Gupta     99   Bhopal   NaN

In [39]:
d_l.sort_values(by='place', ascending=False)

     name  marks    place  ages
R1  Akash    100  Sasaram   NaN
R2  Kumar     98    Patna   NaN
R3  Gupta     99   Bhopal   NaN

In [40]:
d_l.sort_values(by=['ages','marks'],ascending=False)

     name  marks    place  ages
R1  Akash    100  Sasaram   NaN
R3  Gupta     99   Bhopal   NaN
R2  Kumar     98    Patna   NaN

In [41]:
# access columns values in series
# method  1 in Seies
d_s['str']

0    a
1    b
2    c
3    d
4    e
Name: str, dtype: object

In [42]:
# method 2 in Series
d_s.str

0    a
1    b
2    c
3    d
4    e
Name: str, dtype: object

In [43]:
# accessing multiple colums values in DataFrame
# method 1
d_s[['str','U_str']]      # use double squre Brecket

  str U_str
0   a     A
1   b     B
2   c     C
3   d     D
4   e     E

In [44]:
# loc function in row can indexing  and slicing but column write a column name
# method - 2 with loc function
d_s.loc[[1,2,4,1],['str','int']]  # v.loc[[1,3,4(random_indexing)],['cl_name1','cl_name2']]

  str  int
1   b    2
2   c    3
4   e    5
1   b    2

In [45]:
# loc function in row can indexing  and slicing but column write a column name
# method - 3  with loc function
d_s.loc[1:2,['int']] # v.loc[ 2:30 (slicing),['cl_name1,cl_name2']

   int
1    2
2    3

In [46]:
d_s

   int str U_str  float
0    1   a     A    1.1
1    2   b     B    1.2
2    3   c     C    1.3
3    4   d     D    1.4
4    5   e     E    1.5

In [47]:
d_s.loc[:,['float']]

   float
0    1.1
1    1.2
2    1.3
3    1.4
4    1.5

In [48]:
import numpy as np                             
a=np.array([[1,2,3],[4,5,6],[7,8,9]])
a[[1,2,0,2,1],[0,1,1,2,1]]

array([4, 8, 2, 9, 5])

In [49]:
# method -1 in v.iloc[]
# v.iloc[ 1:2 (sliceing),[cl_index_n1,cl_index_n2]]

In [50]:
d_s.iloc[1:,[0,3]]      # index no. use for columns

   int  float
1    2    1.2
2    3    1.3
3    4    1.4
4    5    1.5

In [51]:
d_s.iloc[[1,2],[0]]    # v.iloc[[r1,r3(row_indexing)],[c0,c4(column_indexing)]]

   int
1    2
2    3

In [52]:
d_s.iloc[:,:]           # v.iloc[start:end:step(row),start:end:step(columns)]

   int str U_str  float
0    1   a     A    1.1
1    2   b     B    1.2
2    3   c     C    1.3
3    4   d     D    1.4
4    5   e     E    1.5

In [54]:
import pandas as pd

In [56]:
df=pd.read_csv('C:\\Users\\akash\\Desktop\\Iris.csv')

In [57]:
df.head

<bound method NDFrame.head of       Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  \
0      1            5.1           3.5            1.4           0.2
1      2            4.9           3.0            1.4           0.2
2      3            4.7           3.2            1.3           0.2
3      4            4.6           3.1            1.5           0.2
4      5            5.0           3.6            1.4           0.2
..   ...            ...           ...            ...           ...
145  146            6.7           3.0            5.2           2.3
146  147            6.3           2.5            5.0           1.9
147  148            6.5           3.0            5.2           2.0
148  149            6.2           3.4            5.4           2.3
149  150            5.9           3.0            5.1           1.8

            Species
0       Iris-setosa
1       Iris-setosa
2       Iris-setosa
3       Iris-setosa
4       Iris-setosa
..              ...
145  Iris-virginica
146  Iris-virginica
147  Iris-virginica
148  Iris-virginica
149  Iris-virginica

[150 rows x 6 columns]>

In [58]:
df.info

<bound method DataFrame.info of       Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  \
0      1            5.1           3.5            1.4           0.2
1      2            4.9           3.0            1.4           0.2
2      3            4.7           3.2            1.3           0.2
3      4            4.6           3.1            1.5           0.2
4      5            5.0           3.6            1.4           0.2
..   ...            ...           ...            ...           ...
145  146            6.7           3.0            5.2           2.3
146  147            6.3           2.5            5.0           1.9
147  148            6.5           3.0            5.2           2.0
148  149            6.2           3.4            5.4           2.3
149  150            5.9           3.0            5.1           1.8

            Species
0       Iris-setosa
1       Iris-setosa
2       Iris-setosa
3       Iris-setosa
4       Iris-setosa
..              ...
145  Iris-virginica
146  Iris-virginica
147  Iris-virginica
148  Iris-virginica
149  Iris-virginica

[150 rows x 6 columns]>

In [59]:
df.loc[[10,130,80],['PetalLengthCm']]    # with indexing

     PetalLengthCm
10             1.5
130            6.1
80             3.8

In [60]:
df.loc[:,['SepalLengthCm','PetalLengthCm']].head(2)

   SepalLengthCm  PetalLengthCm
0            5.1            1.4
1            4.9            1.4

In [61]:
df.loc[(df['SepalWidthCm']>4)&(df['SepalLengthCm']>5)&(df['Species']=='Iris-setosa')]

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
15  16            5.7           4.4            1.5           0.4  Iris-setosa
32  33            5.2           4.1            1.5           0.1  Iris-setosa
33  34            5.5           4.2            1.4           0.2  Iris-setosa

In [62]:
df.iloc[[1,125,93],[1,2,3,4,5]] # with indexing

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm          Species
1              4.9           3.0            1.4           0.2      Iris-setosa
125            7.2           3.2            6.0           1.8   Iris-virginica
93             5.0           2.3            3.3           1.0  Iris-versicolor

In [63]:
df.iloc[3:10,1:]

   SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
3            4.6           3.1            1.5           0.2  Iris-setosa
4            5.0           3.6            1.4           0.2  Iris-setosa
5            5.4           3.9            1.7           0.4  Iris-setosa
6            4.6           3.4            1.4           0.3  Iris-setosa
7            5.0           3.4            1.5           0.2  Iris-setosa
8            4.4           2.9            1.4           0.2  Iris-setosa
9            4.9           3.1            1.5           0.1  Iris-setosa

In [64]:
d_s

   int str U_str  float
0    1   a     A    1.1
1    2   b     B    1.2
2    3   c     C    1.3
3    4   d     D    1.4
4    5   e     E    1.5

In [65]:
d_s.query('int > 4') # extract quanitative values

   int str U_str  float
4    5   e     E    1.5

In [66]:
d_s[d_s['int']>4]

   int str U_str  float
4    5   e     E    1.5

In [67]:
d_s[['int','str','float']].query('int<6 & float>1.1')

   int str  float
1    2   b    1.2
2    3   c    1.3
3    4   d    1.4
4    5   e    1.5

In [68]:
d_s[['int','str','float']].query('int<6 and float>1.1')

   int str  float
1    2   b    1.2
2    3   c    1.3
3    4   d    1.4
4    5   e    1.5

In [69]:
d_s[['int','str','float']][(d_s['int']<6) & (d_s['float']>1.1)]

   int str  float
1    2   b    1.2
2    3   c    1.3
3    4   d    1.4
4    5   e    1.5

In [70]:
#d_s[['int','str','float']][(d_s['int']<6) and (d_s['float']>1.1)]

In [71]:
d_s.query('str=="c"')

   int str U_str  float
2    3   c     C    1.3

In [72]:
d_s.query('int==3')

   int str U_str  float
2    3   c     C    1.3

In [73]:
d_s

   int str U_str  float
0    1   a     A    1.1
1    2   b     B    1.2
2    3   c     C    1.3
3    4   d     D    1.4
4    5   e     E    1.5

In [74]:
d_s[['int','str']][d_s['float']<1.9]

   int str
0    1   a
1    2   b
2    3   c
3    4   d
4    5   e

In [75]:
d_l[['name','marks']][d_l['marks']>98]

     name  marks
R1  Akash    100
R3  Gupta     99

In [76]:
d_l[['name','marks']].query('marks>98')

     name  marks
R1  Akash    100
R3  Gupta     99

In [77]:
d_l[['name','marks']][d_l['marks']>97].sum()

name     AkashKumarGupta
marks                297
dtype: object

In [78]:
d_l[['name','marks']].query('marks>90').sum()

name     AkashKumarGupta
marks                297
dtype: object

In [79]:
d_l[['marks','name']][d_l['marks']==100]

    marks   name
R1    100  Akash

In [80]:
d_l[['marks','name']].query('marks==100')

    marks   name
R1    100  Akash

In [83]:
l=[18,20,28] 
l_l=pd.Series(l,index=('R1','R2','R3'))
d_l['ages']=l_l
d_l

     name  marks    place  ages
R1  Akash    100  Sasaram    18
R2  Kumar     98    Patna    20
R3  Gupta     99   Bhopal    28

In [85]:
d_l.query('marks>=100 and ages<=18')

     name  marks    place  ages
R1  Akash    100  Sasaram    18

In [87]:
d_l.query('marks>=100 or ages<=28')

     name  marks    place  ages
R1  Akash    100  Sasaram    18
R2  Kumar     98    Patna    20
R3  Gupta     99   Bhopal    28

In [89]:
d_l.query('(marks>=100 and ages>=18) and name=="Akash"')

     name  marks    place  ages
R1  Akash    100  Sasaram    18

In [96]:
d_l.query('marks>=100 or ages<=28 or name=="Akash"')

     name  marks    place  ages
R1  Akash    100  Sasaram    18
R2  Kumar     98    Patna    20
R3  Gupta     99   Bhopal    28

In [97]:
d_l[(d_l['marks']>=100) | (d_l['ages']<=28) | (d_l['name']=='Akash')]

     name  marks    place  ages
R1  Akash    100  Sasaram    18
R2  Kumar     98    Patna    20
R3  Gupta     99   Bhopal    28

In [98]:
df.query('PetalLengthCm>1 and PetalWidthCm>0.3 and Species=="Iris-setosa"')

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
5    6            5.4           3.9            1.7           0.4  Iris-setosa
15  16            5.7           4.4            1.5           0.4  Iris-setosa
16  17            5.4           3.9            1.3           0.4  Iris-setosa
21  22            5.1           3.7            1.5           0.4  Iris-setosa
23  24            5.1           3.3            1.7           0.5  Iris-setosa
26  27            5.0           3.4            1.6           0.4  Iris-setosa
31  32            5.4           3.4            1.5           0.4  Iris-setosa
43  44            5.0           3.5            1.6           0.6  Iris-setosa
44  45            5.1           3.8            1.9           0.4  Iris-setosa

In [99]:
df[(df['PetalLengthCm']>1) & (df['PetalWidthCm']>0.3) & (df['Species']=='Iris-setosa')]

    Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
5    6            5.4           3.9            1.7           0.4  Iris-setosa
15  16            5.7           4.4            1.5           0.4  Iris-setosa
16  17            5.4           3.9            1.3           0.4  Iris-setosa
21  22            5.1           3.7            1.5           0.4  Iris-setosa
23  24            5.1           3.3            1.7           0.5  Iris-setosa
26  27            5.0           3.4            1.6           0.4  Iris-setosa
31  32            5.4           3.4            1.5           0.4  Iris-setosa
43  44            5.0           3.5            1.6           0.6  Iris-setosa
44  45            5.1           3.8            1.9           0.4  Iris-setosa

In [100]:
print(df['Species'].value_counts())
df_cq=df[df['Species']!='Iris-setosa'] 
print(df_cq['Species'].value_counts())

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64

In [101]:
df.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [103]:
df4.columns=['i','sl','sw','pl','pw','s']

NameError: name 'df4' is not defined